# AI-Lab: 12
### Rollnumber: BSAIM-F24-195
### Name: Aman Ali

<div class="alert alert-block alert-success">
    Import <b>Libraries</b>
</div>

In [62]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder as enc
from sklearn.model_selection import train_test_split
from sklearn.svm import SVC
from sklearn.metrics import accuracy_score
import pickle

<div class="alert alert-block alert-info">
    1. <b>Data Gathering</b>
    <br>
    2. <b>Data Loading</b>
</div>

In [63]:
df = pd.read_excel("data.xlsx")
df

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,2014-05-02,3.130000e+05,3,1.50,1340.0,7912.0,1.5,0.0,0.0,3.0,1340.0,0.0,1955.0,2005.0,18810 Densmore Ave N,Shoreline,WA 98133,USA
1,2014-05-02,2.384000e+06,5,2.50,3650.0,9050.0,2.0,0.0,4.0,5.0,3370.0,280.0,1921.0,0.0,709 W Blaine St,Seattle,WA 98119,USA
2,2014-05-02,3.420000e+05,3,2.00,1930.0,11947.0,1.0,0.0,0.0,4.0,1930.0,0.0,1966.0,0.0,26206-26214 143rd Ave SE,Kent,WA 98042,USA
3,2014-05-02,4.200000e+05,3,2.25,2000.0,8030.0,1.0,0.0,0.0,4.0,1000.0,1000.0,1963.0,0.0,857 170th Pl NE,Bellevue,WA 98008,USA
4,2014-05-02,5.500000e+05,4,2.50,1940.0,10500.0,1.0,0.0,0.0,4.0,1140.0,800.0,1976.0,1992.0,9105 170th Ave NE,Redmond,WA 98052,USA
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4595,2014-07-09,3.081667e+05,3,1.75,1510.0,6360.0,1.0,0.0,0.0,4.0,1510.0,0.0,1954.0,1979.0,501 N 143rd St,Seattle,WA 98133,USA
4596,2014-07-09,5.343333e+05,3,2.50,1460.0,7573.0,2.0,0.0,0.0,3.0,1460.0,0.0,1983.0,2009.0,14855 SE 10th Pl,Bellevue,WA 98007,USA
4597,2014-07-09,4.169042e+05,3,2.50,3010.0,7014.0,2.0,0.0,0.0,3.0,3010.0,0.0,2009.0,0.0,759 Ilwaco Pl NE,Renton,WA 98059,USA
4598,2014-07-10,2.034000e+05,4,2.00,2090.0,6630.0,1.0,0.0,0.0,3.0,1070.0,1020.0,1974.0,0.0,5148 S Creston St,Seattle,WA 98178,USA
4599,2014-07-10,2.206000e+05,3,2.50,1490.0,8102.0,2.0,0.0,0.0,4.0,1490.0,0.0,1990.0,0.0,18717 SE 258th St,Covington,WA 98042,USA

In [64]:
df.sample(5)

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
472,2014-05-12,885000.0,4,2.50,2830.0,5000.0,2.0,0.0,0.0,3.0,2830.0,0.0,1995.0,0.0,3503 NE 43rd St,Seattle,WA 98105,USA
569,2014-05-13,591000.0,3,1.75,1680.0,2400.0,1.0,0.0,0.0,5.0,870.0,810.0,1922.0,1956.0,1600-1608 25th Ave,Seattle,WA 98122,USA
1155,2014-05-22,219900.0,3,1.00,910.0,6000.0,1.0,0.0,0.0,2.0,910.0,0.0,1956.0,0.0,303 SW 108th St,Seattle,WA 98146,USA
1329,2014-05-27,360000.0,3,1.00,1570.0,9467.0,1.0,0.0,0.0,3.0,1570.0,0.0,1954.0,2005.0,19141 1st Ave NW,Shoreline,WA 98177,USA
428,2014-05-09,566000.0,3,2.25,1660.0,10140.0,1.0,0.0,0.0,4.0,1370.0,290.0,1980.0,0.0,9828 159th Pl NE,Redmond,WA 98052,USA

<div class="alert alert-block alert-info">
    4. <b>Data Pre-Processing</b>
</div>

In [65]:
print('We have {} rows.'.format(df.shape[0])) 
print('We have {} columns'.format(df.shape[1]))

We have 4600 rows.
We have 18 columns

In [66]:
df.isnull().sum()

date               0
price              0
bedrooms           0
bathrooms        424
sqft_living      424
sqft_lot         596
floors           596
waterfront       708
view             708
condition        708
sqft_above       708
sqft_basement    708
yr_built         536
yr_renovated     536
street           112
city             112
statezip         112
country          112
dtype: int64

In [67]:
def unique_col(col):
    print(f"Unique Values in {col} are : ")
    for i in col:
        print(f"{i} : ",df[i].unique())
        print()

In [68]:
columns = ['bedrooms', 'bathrooms',
       'floors', 'waterfront', 'view', 'condition', 'yr_built', 'yr_renovated', 'street', 'city',
       'statezip', 'country']


col_all = ['price', 'bedrooms', 'bathrooms', 'sqft_living', 'sqft_lot',
       'floors', 'waterfront', 'view', 'condition', 'sqft_above',
       'sqft_basement', 'yr_built', 'yr_renovated', 'street', 'city',
       'statezip', 'country']

In [69]:
unique_col(columns)

Unique Values in ['bedrooms', 'bathrooms', 'floors', 'waterfront', 'view', 'condition', 'yr_built', 'yr_renovated', 'street', 'city', 'statezip', 'country'] are :
bedrooms :  [3 5 4 2 6 7 9 1 8 0]

bathrooms :  [1.5  2.5  2.   2.25 1.   1.75 2.75 3.   3.25 3.5  8.   4.25 4.   3.75
 5.   4.5  5.75 1.25 6.5  4.75 0.75 5.25 5.5   nan 6.25 0.   6.75]

floors :  [1.5 2.  1.  2.5 3.  nan 3.5]

waterfront :  [ 0.  1. nan]

view :  [ 0.  4.  1.  2.  3. nan]

condition :  [ 3.  5.  4.  2.  1. nan]

yr_built :  [1955. 1921. 1966. 1963. 1976. 1938. 1989. 1985. 1945. 1948. 1909. 1980.
 1939. 1965. 1956. 1997. 1987. 1983. 1923. 1954. 2005. 1991. 1959. 1920.
 1979. 1951. 1967. 2004. 2014. 1995. 1944. 1992. 1957. 1978. 1974. 1950.
 1990. 1949. 1968. 1977. 1996. 2001. 2000. 1929. 2006. 2008. 2009. 2012.
 2013. 2007. 1986. 1973. 1988. 1900. 1928. 1982. 1960. 2003. 1998. 1942.
 1908. 1958. 1971. 1975. 1961. 1924. 1902. 1962. 1953. 1999. 1994. 1930.
 1984. 2010. 1912. 1947. 1916. 1940. 1970. 1952. 1964. 1926. 1905. 1969.
 1903. 1943. 1993. 1946. 1910. 1904. 1981. 1906. 1922. 2011. 2002. 1917.
 1913. 1914. 1937. 1925. 1932. 1918. 1972. 1941. 1919. 1936. 1911. 1927.
 1931. 1901. 1907. 1915. 1935. 1933.   nan 1934.]

yr_renovated :  [2005.    0. 1992. 1994. 2010. 1988. 2009. 1969. 2000. 1979. 1989. 2014.
 1999. 2003. 1983. 1997. 1912. 1923. 1954. 2011. 2001. 2013. 2006. 1972.
 1985. 1998. 2004. 1958. 2008. 1970. 1982. 1986. 1996. 2002. 1971. 1990.
 1956. 1945. 1984. 2012. 1993. 2007. 1981. 1974. 1963. 1968. 1995. 1934.
 1953. 1966. 1955.   nan 1978. 1980. 1948. 1991. 1913. 1977. 1975.]

street :  ['18810 Densmore Ave N' '709 W Blaine St' '26206-26214 143rd Ave SE' ...
 '759 Ilwaco Pl NE' '5148 S Creston St' '18717 SE 258th St']

city :  ['Shoreline' 'Seattle' 'Kent' 'Bellevue' 'Redmond' 'Maple Valley'
 'North Bend' 'Lake Forest Park' 'Sammamish' 'Auburn' 'Des Moines'
 'Bothell' 'Federal Way' 'Kirkland' 'Issaquah' 'Woodinville'
 'Normandy Park' 'Fall City' 'Renton' 'Carnation' 'Snoqualmie' 'Duvall'
 'Burien' 'Covington' 'Inglewood-Finn Hill' 'Kenmore' 'Newcastle'
 'Mercer Island' 'Black Diamond' 'Ravensdale' 'Clyde Hill' 'Algona'
 'Skykomish' 'Tukwila' 'Vashon' 'Yarrow Point' 'SeaTac' 'Medina'
 'Enumclaw' 'Snoqualmie Pass' 'Pacific' 'Beaux Arts Village' 'Preston'
 'Milton' nan]

statezip :  ['WA 98133' 'WA 98119' 'WA 98042' 'WA 98008' 'WA 98052' 'WA 98115'
 'WA 98038' 'WA 98045' 'WA 98155' 'WA 98105' 'WA 98074' 'WA 98106'
 'WA 98007' 'WA 98092' 'WA 98198' 'WA 98006' 'WA 98102' 'WA 98011'
 'WA 98125' 'WA 98003' 'WA 98136' 'WA 98033' 'WA 98029' 'WA 98117'
 'WA 98034' 'WA 98072' 'WA 98023' 'WA 98107' 'WA 98166' 'WA 98116'
 'WA 98024' 'WA 98055' 'WA 98077' 'WA 98027' 'WA 98059' 'WA 98075'
 'WA 98014' 'WA 98065' 'WA 98199' 'WA 98053' 'WA 98058' 'WA 98122'
 'WA 98103' 'WA 98112' 'WA 98005' 'WA 98118' 'WA 98177' 'WA 98004'
 'WA 98019' 'WA 98144' 'WA 98168' 'WA 98001' 'WA 98056' 'WA 98146'
 'WA 98028' 'WA 98148' 'WA 98057' 'WA 98040' 'WA 98010' 'WA 98051'
 'WA 98031' 'WA 98109' 'WA 98030' 'WA 98126' 'WA 98032' 'WA 98178'
 'WA 98288' 'WA 98108' 'WA 98070' 'WA 98188' 'WA 98002' 'WA 98039'
 'WA 98022' 'WA 98068' 'WA 98047' 'WA 98050' 'WA 98354' nan]

country :  ['USA' nan]

<div class="alert alert-block alert-warning">
    4.1. <b>Manage Null Values</b>
</div>

In [70]:
df.isnull().sum()

date               0
price              0
bedrooms           0
bathrooms        424
sqft_living      424
sqft_lot         596
floors           596
waterfront       708
view             708
condition        708
sqft_above       708
sqft_basement    708
yr_built         536
yr_renovated     536
street           112
city             112
statezip         112
country          112
dtype: int64

In [71]:
def fillnaObjectMode(cols):
    for i in cols:
        df[i].fillna(df[i].mode()[0] , inplace=True)

columns = ['city', 'street', 'statezip']
fillnaObjectMode(columns)

C:\Users\HP\AppData\Local\Temp\ipykernel_8708\1510866865.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[i].fillna(df[i].mode()[0] , inplace=True)

In [72]:
def fillnaIntMode(cols):
    for i in cols:
        df[i].fillna(df[i].mode()[0], inplace=True)

columns = ['bedrooms','bathrooms','floors','waterfront','view','yr_built','yr_renovated']
fillnaIntMode(columns)

C:\Users\HP\AppData\Local\Temp\ipykernel_8708\2616523271.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[i].fillna(df[i].mode()[0], inplace=True)

In [73]:

def fillnaFloatMean(cols):
    for i in cols:
        df[i].fillna(df[i].mean(), inplace=True)

columns = ['price','condition','sqft_living','sqft_lot','sqft_above','sqft_basement']
fillnaFloatMean(columns)

C:\Users\HP\AppData\Local\Temp\ipykernel_8708\975572959.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[i].fillna(df[i].mean(), inplace=True)

In [74]:
df.isnull().sum()

date               0
price              0
bedrooms           0
bathrooms          0
sqft_living        0
sqft_lot           0
floors             0
waterfront         0
view               0
condition          0
sqft_above         0
sqft_basement      0
yr_built           0
yr_renovated       0
street             0
city               0
statezip           0
country          112
dtype: int64

In [75]:
fillnaObjectMode(["country"])

C:\Users\HP\AppData\Local\Temp\ipykernel_8708\1510866865.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[i].fillna(df[i].mode()[0] , inplace=True)

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4600 entries, 0 to 4599
Data columns (total 18 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           4600 non-null   datetime64[ns]
 1   price          4600 non-null   float64
 2   bedrooms       4600 non-null   int64
 3   bathrooms      4600 non-null   float64
 4   sqft_living    4600 non-null   float64
 5   sqft_lot       4600 non-null   float64
 6   floors         4600 non-null   float64
 7   waterfront     4600 non-null   float64
 8   view           4600 non-null   float64
 9   condition      4600 non-null   float64
 10  sqft_above     4600 non-null   float64
 11  sqft_basement  4600 non-null   float64
 12  yr_built       4600 non-null   float64
 13  yr_renovated   4600 non-null   float64
 14  street         4600 non-null   object
 15  city           4600 non-null   object
 16  statezip       4600 non-null   object
 17  country        4600 non-null   object
dtypes: datetime64[ns](1), float64(12), int64(1), object(4)
memory usage: 647.0+ KB

In [77]:
df.isnull().sum()

date             0
price            0
bedrooms         0
bathrooms        0
sqft_living      0
sqft_lot         0
floors           0
waterfront       0
view             0
condition        0
sqft_above       0
sqft_basement    0
yr_built         0
yr_renovated     0
street           0
city             0
statezip         0
country          0
dtype: int64

<div class="alert alert-block alert-warning">
    4.2. <b>Manage Data Types</b>
</div>

In [78]:

def ChangeFloatToInt(cols):
    for i in cols:
        df[i] = df[i].astype('int64')


columns = ['price','bathrooms','sqft_living','sqft_lot' , 'floors' , 'waterfront','view','condition','sqft_above','sqft_basement','yr_built','yr_renovated']

ChangeFloatToInt(columns)

In [79]:
df.drop(columns=['date','country'],inplace=True)

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4600 entries, 0 to 4599
Data columns (total 16 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   price          4600 non-null   int64
 1   bedrooms       4600 non-null   int64
 2   bathrooms      4600 non-null   int64
 3   sqft_living    4600 non-null   int64
 4   sqft_lot       4600 non-null   int64
 5   floors         4600 non-null   int64
 6   waterfront     4600 non-null   int64
 7   view           4600 non-null   int64
 8   condition      4600 non-null   int64
 9   sqft_above     4600 non-null   int64
 10  sqft_basement  4600 non-null   int64
 11  yr_built       4600 non-null   int64
 12  yr_renovated   4600 non-null   int64
 13  street         4600 non-null   object
 14  city           4600 non-null   object
 15  statezip       4600 non-null   object
dtypes: int64(13), object(3)
memory usage: 575.1+ KB

In [81]:
def convertObjToInt(cols):
    for i in cols:
        data = pd.DataFrame({i:df[i].unique()})
        dat_LE = enc()
        dat_LE.fit(np.ravel(data))
        df[i] = dat_LE.transform(df[i])
        
columns = ['street', 'city', 'statezip']
convertObjToInt(columns)
convertObjToInt(columns)

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4600 entries, 0 to 4599
Data columns (total 16 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   price          4600 non-null   int64
 1   bedrooms       4600 non-null   int64
 2   bathrooms      4600 non-null   int64
 3   sqft_living    4600 non-null   int64
 4   sqft_lot       4600 non-null   int64
 5   floors         4600 non-null   int64
 6   waterfront     4600 non-null   int64
 7   view           4600 non-null   int64
 8   condition      4600 non-null   int64
 9   sqft_above     4600 non-null   int64
 10  sqft_basement  4600 non-null   int64
 11  yr_built       4600 non-null   int64
 12  yr_renovated   4600 non-null   int64
 13  street         4600 non-null   int64
 14  city           4600 non-null   int64
 15  statezip       4600 non-null   int64
dtypes: int64(16)
memory usage: 575.1 KB

<div class="alert alert-block alert-info">
    5. <b>Train Test Split</b>
</div>

In [83]:
X = df.drop('price', axis=1)   
y = df['price']

In [84]:
train_X, test_X, train_y, test_y = train_test_split(X,y, test_size=0.3, shuffle=False)

In [85]:
print(train_X.shape, train_y.shape)
print(test_X.shape, test_y.shape)

(3220, 15) (3220,)
(1380, 15) (1380,)

<div class="alert alert-block alert-info">
    6. <b>Applying Classifier / Model Training</b>
</div>

In [86]:

model_svc = SVC()
model_svc.fit(train_X, train_y)

print(model_svc)

SVC()

In [87]:
model_pred_svc = model_svc.predict(test_X)
model_pred_svc

array([300000, 400000, 300000, ..., 300000, 300000, 300000], dtype=int64)

In [88]:

model_acc_svc = accuracy_score(test_y, model_pred_svc)
print(round(model_acc_svc,3)*100, "%")

1.4000000000000001 %

<div class="alert alert-block alert-info">
    7. <b>Saving Dataset & Model File</b>
</div>

In [89]:
df.to_csv("processed_data.csv")

In [90]:
pickle.dump(model_svc, open('model_svc.pkl', 'wb'))